Бухгалтерские_задачи_Занятие_5/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <basedOn>Document.ПриобретениеТоваровИУслуг</basedOn>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПродажиТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бухгалтерские_задачи_Занятие_5/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.ПоПодразделениям</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Занятие_5/src/Enums/ВидыОперацийПродажиТоваров/ВидыОперацийПродажиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПродажиТоваров</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСХранения</name>
  </enumValues>
</mdclass:Enum>

Бухгалтерские_задачи_Занятие_5/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>НеИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Занятие_5/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидОперации = Перечисления.ВидыОперацийПродажиТоваров.Продажа Тогда

		ПродажаТовара(Отказ, Режим);

	Иначе

		ВозвратТовараВладельцу(Отказ, Режим);

	КонецЕсли;

	Если Отказ = Ложь Тогда

		Движения.Проводки.Записывать = Истина;

	КонецЕсли;

КонецПроцедуры

Процедура ПродажаТовара(Отказ, Режим)

	//В учебных целях (для упрощения) делаем допущение, что складской учет ведется.

	//--БЛОКИРОВКА

	//--ОЧИСТКА ДВИЖЕНИЙ ЭТОГО ДОКУМЕНТА В БАЗЕ ДАННЫХ


	// ---  ЗАПРОС

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровИУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК Количество,
		|	СУММА(РеализацияТоваровИУслугТовары.Сумма) КАК Сумма,
		|	РеализацияТоваровИУслугТовары.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВТТоварыДокумента
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
		|ГДЕ
		|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровИУслугТовары.Номенклатура,
		|	РеализацияТоваровИУслугТовары.СчетУчета
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроводкиОстатки.Счет КАК Счет,
		|	ПроводкиОстатки.Субконто1 КАК Субконто1,
		|	ПроводкиОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт
		|ПОМЕСТИТЬ ВТОстаткиСклад
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет В
		|		(ВЫБРАТЬ
		|			ВТТоварыДокумента.СчетУчета КАК СчетУчета
		|		ИЗ
		|			ВТТоварыДокумента КАК ВТТоварыДокумента),, Организация = &Организация
		|	И Подразделение = &Подразделение
		|	И Субконто2 = &Склад
		|	И Субконто1 В
		|		(ВЫБРАТЬ
		|			ВТТоварыДокумента.Номенклатура КАК Номенклатура
		|		ИЗ
		|			ВТТоварыДокумента КАК ВТТоварыДокумента)) КАК ПроводкиОстатки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроводкиОстатки.Счет КАК Счет,
		|	ПроводкиОстатки.Субконто1 КАК Субконто1,
		|	ПроводкиОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт,
		|	ПроводкиОстатки.СуммаОстатокДт КАК СуммаОстатокДт
		|ПОМЕСТИТЬ ВТОстаткиВсе
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет В
		|		(ВЫБРАТЬ
		|			ВТТоварыДокумента.СчетУчета КАК СчетУчета
		|		ИЗ
		|			ВТТоварыДокумента КАК ВТТоварыДокумента),, Организация = &Организация
		|	И Подразделение = &Подразделение
		|	И Субконто1 В
		|		(ВЫБРАТЬ
		|			ВТТоварыДокумента.Номенклатура КАК Номенклатура
		|		ИЗ
		|			ВТТоварыДокумента КАК ВТТоварыДокумента)) КАК ПроводкиОстатки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТоварыДокумента.Номенклатура КАК Номенклатура,
		|	ВТТоварыДокумента.Количество КАК Количество,
		|	ВТТоварыДокумента.Сумма КАК Сумма,
		|	ВТТоварыДокумента.СчетУчета КАК СчетУчета,
		|	ЕСТЬNULL(ВТОстаткиСклад.КоличествоОстатокДт, 0) КАК КоличествоОстатокДт,
		|	ЕСТЬNULL(ВТОстаткиВсе.КоличествоОстатокДт, 0) КАК КоличествоВсего,
		|	ЕСТЬNULL(ВТОстаткиВсе.СуммаОстатокДт, 0) КАК СуммаВсего
		|ИЗ
		|	ВТТоварыДокумента КАК ВТТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиСклад КАК ВТОстаткиСклад
		|		ПО ВТТоварыДокумента.СчетУчета = ВТОстаткиСклад.Счет
		|		И ВТТоварыДокумента.Номенклатура = ВТОстаткиСклад.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиВсе КАК ВТОстаткиВсе
		|		ПО ВТТоварыДокумента.СчетУчета = ВТОстаткиВсе.Счет
		|		И ВТТоварыДокумента.Номенклатура = ВТОстаткиВсе.Субконто1";

	Результат = Запрос.Выполнить();

	//--ВЫБОРКА ИЗ РЕЗУЛЬТАТА ЗАПРОСА
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл

	//--ПРОВЕРКА НАЛИЧИЯ УЧТЕННОГО ТМЦ ПО СЧЕТУ НА СКЛАДЕ
		Нехватка = Выборка.Количество - Выборка.КоличествоОстатокДт;

		Если Нехватка > 0 Тогда

			Отказ = Истина;

			Сообщение = Новый СообщениеПользователю;

			Сообщение.Текст = "Для проведения по данным бухгалтерского учета по счету "
				+ Выборка.СчетУчета + " не хватает номенклатуры """ + Выборка.Номенклатура
				+ """. Нехватка составляет " + Нехватка + " ед.";

			Сообщение.Сообщить();

		КонецЕсли;

		//--Формируем движения в регистре бухгелтрии
		Если Отказ = Ложь Тогда

		//=========================================================================
			//-- ПРОВОДКА = ДЕБЕТ (90) РАСХОДЫ -  КРЕДИТ СЧЕТ УЧЕТА ТМЦ (10, 41.1, 41.2) - СУММА СЕБЕСТОИМОСТИ 
			Движение = Движения.Проводки.Добавить();

			Движение.Период = Дата;
			Движение.СодержаниеПроводки = "Себестоимость продажи";
			Движение.Организация = Организация;

			Если (Выборка.КоличествоВсего = 0) Тогда
				Себестоимость = 0;
			ИначеЕсли (Выборка.КоличествоВсего = Выборка.Количество) Тогда
				Себестоимость = Выборка.СуммаВсего;
			Иначе
				Себестоимость = Выборка.СуммаВсего / Выборка.КоличествоВсего
					* Выборка.Количество;
			КонецЕсли;

			Движение.Сумма = Себестоимость;

			Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
			Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");

			Движение.СчетКт = Выборка.СчетУчета;

			Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");
			Бухгалтерия.ЗаполнитьКоличествоСтороныПроводки(Движение, Выборка.Количество, "Кт");

			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение, "Номенклатура", Выборка.Номенклатура, "Кт");
			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение, "Склады", Склад, "Кт");
			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение, "Контрагенты", Контрагент, "Кт");

			//=========================================================================
			//-- ПРОВОДКА = ДЕБЕТ (62.1) РАСЧЕТЫ С ПОКУПАТЕЛЕМ - ТМЦ КРЕДИТ (90) ДОХОДЫ
			Движение = Движения.Проводки.Добавить();

			Движение.Период = Дата;
			Движение.СодержаниеПроводки = "Выручка от продажи";
			Движение.Организация = Организация;
			Движение.Сумма = Выборка.Сумма;

			Движение.СчетДт = ПланыСчетов.Счета.ПокупателямОтгрузили;

			Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");

			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение, "Контрагенты", Контрагент, "Дт");
			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение, "Договоры", Договор, "Дт");

			Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(Движение, Валюта, Выборка.Сумма, "Дт");

			Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;

			Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");

			//? Может пригодиться
			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение, "Номенклатура", Выборка.Номенклатура, "Кт");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ВозвратТовараВладельцу(Отказ, Режим)

//Контрольная работа...
КонецПроцедуры
